src/bsl/Enums/гкс_ТипыТочекОбменаRMQ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>гкс_ТипыТочекОбменаRMQ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Direct</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Topic</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Fanout</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/bsl/Catalogs/ИсходящиеСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ИсходящиеСообщения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаВремяСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УниверсальнаяДатаСобытияВМиллисекундах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаПубликации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючМаршрутизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремяОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерверОчередей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерверыОчередейRMQ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойстваСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКлючСоединения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорневойИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хоп</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>гкс_ОбъектСобытия</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>гкс_НастройкаПолучателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ПолучателиДанныхRMQ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКонтракта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСостав</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВыгруженныеОбъекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/bsl/CommonModules/ОтправкаСообщений/Ext/Module.bsl
#Область СлужебныеПроцедурыиФункции

Процедура ПоФИФОИзОчередиИсходящих(ОтборСервер = Неопределено,
	                                        ОтборТочкаПубликации = Неопределено,
	                                        ОтборСообщения = Неопределено) Экспорт

	ИмяНастройки = "ИспользованиеОбработкиСообщенийПоТочкам";
	ИспользованиеОбработкиСообщенийПоТочкам = гкс_ОчередьСообщенийRMQПовтИсп.НастройкаИнтеграционногоАдаптера(ИмяНастройки);

	Если ИспользованиеОбработкиСообщенийПоТочкам Тогда

		ПоФИФОИзОчередиИсходящихПоТочкам();
		Возврат;

	КонецЕсли;

	гкс_ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания("ОтправкаИсходящихСообщений");

	УстановитьПривилегированныйРежим(Истина);

	Если НЕ гкс_ОчередьСообщенийRMQВызовСервера.ВключенОбменСRMQ() Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СерверОчередей", ОтборСервер);
	Запрос.УстановитьПараметр("ТочкаПубликации", ОтборТочкаПубликации);
	Запрос.УстановитьПараметр("МассивСообщений", ОтборСообщения);

	Запрос.Текст = Справочники.ИсходящиеСообщения.ТекстЗапросаИсходящиеСообщенияКОтправке(ОтборСервер,
                                                                                          ОтборТочкаПубликации,
																						  ОтборСообщения);

	ВыборкаВиртуальныйХост = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаВиртуальныйХост.Следующий() Цикл

		ВыборкаТочкаПубликации = ВыборкаВиртуальныйХост.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

		Пока ВыборкаТочкаПубликации.Следующий() Цикл

			Издатель = ПолучитьИздателяПоПараметрам(ВыборкаТочкаПубликации.ТочкаПубликации,
			                                        ВыборкаТочкаПубликации.КлючСоединения,
			                                        ВыборкаТочкаПубликации.ТипТочкиОбмена);
			Если Издатель = Неопределено Тогда
				Возврат;
			КонецЕсли;

			Выборка = ВыборкаТочкаПубликации.Выбрать();
			Пока Выборка.Следующий() Цикл

				Сообщение = Новый Структура("СообщениеСсылка,
				                            |СвойстваСообщения,
											|НомерСообщения,
											|КлючМаршрутизации,
											|Сообщение");
				ЗаполнитьЗначенияСвойств(Сообщение, Выборка);
				ВыполнитьОбработкуСообщения(Издатель, Сообщение);

			КонецЦикла;

		КонецЦикла;

	КонецЦикла;

КонецПроцедуры

#Область ЗапускОбработкиПоТочкам

Процедура ПоФИФОИзОчередиИсходящихПоТочкам() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	гкс_ТочкиОбменаRMQ.Наименование КАК ТочкаПубликации
	|ИЗ
	|	Справочник.гкс_ТочкиОбменаRMQ КАК гкс_ТочкиОбменаRMQ
	|ГДЕ
	|	гкс_ТочкиОбменаRMQ.ПометкаУдаления = ЛОЖЬ";

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаТочекПубликации = РезультатЗапроса.Выбрать();

	Пока ВыборкаТочекПубликации.Следующий() Цикл
		Попытка
			ЗапуститьОбработкуИсходящихСообщенийДляТочки(ВыборкаТочекПубликации.ТочкаПубликации);
		Исключение

			ЗаписьЖурналаРегистрации(
				"ОтправкаСообщений.Информация",
				УровеньЖурналаРегистрации.Информация,
				,
				,
				"Попытка запуска уже запущенного задания: " + Символы.ПС + ОписаниеОшибки()
				);

		КонецПопытки;
	КонецЦикла;

КонецПроцедуры

Процедура ЗапуститьОбработкуИсходящихСообщенийДляТочки(ТочкаПубликации)

	Если Не ЗначениеЗаполнено(ТочкаПубликации) Тогда
		Возврат;
	КонецЕсли;

	ПараметрыВыполнения = Новый Массив;
	ПараметрыВыполнения.Добавить(ТочкаПубликации);
	НаименованиеФЗ = СтрШаблон("Обработка очереди исходящих сообщений %1", ТочкаПубликации);
	ФоновыеЗадания.Выполнить("ОтправкаСообщений.ОбработатьИсходящиеСообщенияДляТочки",
		ПараметрыВыполнения,
		ТочкаПубликации,
		НаименованиеФЗ);

КонецПроцедуры

Процедура ОбработатьИсходящиеСообщенияДляТочки(ТочкаПубликации) Экспорт

	Если Не ЗначениеЗаполнено(ТочкаПубликации) Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СерверОчередей", Неопределено);
	Запрос.УстановитьПараметр("ТочкаПубликации", ТочкаПубликации);
	Запрос.УстановитьПараметр("МассивСообщений", Неопределено);

	Запрос.Текст = Справочники.ИсходящиеСообщения.ТекстЗапросаИсходящиеСообщенияКОтправке(Неопределено,
                                                                                          ТочкаПубликации,
																						  Неопределено);

	ВыборкаВиртуальныйХост = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаВиртуальныйХост.Следующий() Цикл

		ВыборкаТочкаПубликации = ВыборкаВиртуальныйХост.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

		Пока ВыборкаТочкаПубликации.Следующий() Цикл

			Издатель = ПолучитьИздателяПоПараметрам(ВыборкаТочкаПубликации.ТочкаПубликации,
			                                        ВыборкаТочкаПубликации.КлючСоединения,
			                                        ВыборкаТочкаПубликации.ТипТочкиОбмена);
			Если Издатель = Неопределено Тогда
				Возврат;
			КонецЕсли;

			Выборка = ВыборкаТочкаПубликации.Выбрать();
			Пока Выборка.Следующий() Цикл

				Сообщение = Новый Структура("СообщениеСсылка,
				                            |СвойстваСообщения,
											|НомерСообщения,
											|КлючМаршрутизации,
											|Сообщение");
				ЗаполнитьЗначенияСвойств(Сообщение, Выборка);
				ВыполнитьОбработкуСообщения(Издатель, Сообщение);

			КонецЦикла;

		КонецЦикла;

	КонецЦикла;

КонецПроцедуры

#КонецОбласти

Функция ПолучитьИздателяПоПараметрам(ТочкаПубликации, КлючСоединения, ТипТочкиОбмена) Экспорт

	Попытка

		Если ТипТочкиОбмена = ПредопределенноеЗначение("Перечисление.гкс_ТипыТочекОбменаRMQ.Fanout") Тогда
			Издатель = ОчередьСообщений.НовыйИздатель(ТочкаПубликации, КлючСоединения);
		ИначеЕсли ТипТочкиОбмена = ПредопределенноеЗначение("Перечисление.гкс_ТипыТочекОбменаRMQ.Direct") Тогда
			Издатель = ОчередьСообщений.НовыйАдресныйИздатель(ТочкаПубликации, КлючСоединения);
		Иначе
			Издатель = ОчередьСообщений.НовыйТематическийИздатель(ТочкаПубликации, КлючСоединения);
		КонецЕсли;

	Исключение

		ЗаписьЖурналаРегистрации(
		"ОтправкаСообщений.Ошибка",
		УровеньЖурналаРегистрации.Ошибка,
		,
		,
		"Ошибка инициализации адресного издателя: " + Символы.ПС + ОписаниеОшибки()
		);

		Издатель = Неопределено;

	КонецПопытки;

	Возврат Издатель;

КонецФункции

Процедура ВыполнитьОбработкуСообщения(Издатель, Сообщение)

	Перем СообщениеСсылка;

	Сообщение.Свойство("СообщениеСсылка", СообщениеСсылка);

	НачатьТранзакцию();
	Попытка

		НеобходимоОтправитьВОчередь = Справочники.ИсходящиеСообщения.ОтметитьОтправкуСообщенияВОчередь(СообщениеСсылка);

		Если НеобходимоОтправитьВОчередь Тогда
			// Подготовка и отправка через клиент - объект - обработкау "ИздательСобытий"
			ОтправитьСообщениеВОчередь(Издатель, Сообщение);
		КонецЕсли;

		ЗафиксироватьТранзакцию();
	Исключение
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли;

		ТекстОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("ОтправкаСообщений.Ошибка",
		                         УровеньЖурналаРегистрации.Ошибка,
		                         ,
		                         ,
		                         ТекстОшибки);
	КонецПопытки;

КонецПроцедуры

#Область Прочее

Процедура ОтправитьСообщениеВОчередь(Издатель, Сообщение)

	Перем СвойстваСообщения;
	Перем НомерСообщения;
	Перем КлючМаршрутизации;
	Перем СообщениеТекст;

	Сообщение.Свойство("СвойстваСообщения", СвойстваСообщения);
	Сообщение.Свойство("НомерСообщения", НомерСообщения);
	Сообщение.Свойство("КлючМаршрутизации", КлючМаршрутизации);
	Сообщение.Свойство("Сообщение", СообщениеТекст);

	СвойстваИздателя = ПолучитьСвойстваИздателяИзСвойствСообщения(СвойстваСообщения);
	ДополнитьСвойстваИздателя(СвойстваИздателя, НомерСообщения);
	УстановитьСвойстваИздателя(Издатель, СвойстваИздателя);
	Издатель.ОтправитьСообщение(СообщениеТекст, КлючМаршрутизации, 0, Истина);

КонецПроцедуры

Процедура ДополнитьСвойстваИздателя(СвойстваИздателя, НомерСообщения)

	Если ТипЗнч(СвойстваИздателя) = Тип("Структура") Тогда
		СвойстваИздателя.Вставить("НомерСообщения", НомерСообщения);
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьСвойстваИздателяИзСвойствСообщения(СвойстваСообщения)

	Если ЗначениеЗаполнено(СвойстваСообщения) Тогда

		Попытка
			СвойстваИздателя = ЗначениеИзСтрокиВнутр(СвойстваСообщения);
		Исключение
			СвойстваИздателя = Неопределено;
		КонецПопытки;

		Возврат СвойстваИздателя;

	КонецЕсли;

	Возврат Неопределено;

КонецФункции

Процедура УстановитьСвойстваИздателя(Издатель, СвойстваИздателя)

	Издатель.СброситьЗначенияСвойств();

	Если ЗначениеЗаполнено(СвойстваИздателя) Тогда
		Издатель.УстановитьСвойстваСообщения(СвойстваИздателя);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти
